---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CwpCopyWallInserts
source: html/a597c3c3-74ce-ba1b-8ada-d7d0786e632a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CwpCopyWallInserts Property

"Copy windows/doors/openings"

## Syntax (C#)
```csharp
public static ForgeTypeId CwpCopyWallInserts { get; }
```